
public class Theory1 {
//	패키지(package)
//	
//	클래스의 묶음이다
//	서로 관련된 클래스들 끼리 그룹 단위로 묶어 놓음으로써 클래스를
//	효율적으로 관리할 수 있다
//	
//	다른 개발자가 개발한 클래스를 라이브러리의 클래스와 이름이 충돌하는것을 
//	피할수 있다
//	
//	클래스의 실제 이름은 패키지명을 포함한 것이다(full name)
//	
//	같은 이름의 클래스일 지라도 서로 다른 패키지에 속하면 패키지명으로 구별이 가능하다
//	
//	클래스가 물리적으로 하나의 클래스파일(.class)인 것과 같이
//	패키지는 물리적으로 하나의 디렉토리이다.
//	
//	- 하나의 소스파일에는첫 번째 문장으로 단 한 번의 패키지 선언만을 허용한다
//	- 모든 클래스는 반드시 하나의 패키지에 속해야 한다
//	- 패키지 점(.)을 구분자로 하여 계층구조로 구성할 수 있다
//	- 패키지는 물리적으로 클래스 파일(.class)을 포함하는 하나의 디렉토리이다
//	

}
